import React, { useState } from 'react'

import { InfoScreen, TextInfoScreen, ThreeScreen, FourScreen, LinkToSurveysScreen, MyContainer, MyButton } from '../../../components'

import { CaruselSurvey, TitleScreen } from '../../../constructor'

const Cervix = () => {
    const [state, setState] = useState(false)
    const data1 = [
        {
            type: 'text',
            elem: [
                'Киэли хапчаҕайын рагын сүрүн төрүөтүнэн папиллома вируһа (нууччалыы кылгатан ВПЧ) буолара дакаастанан турар.',
                'ВПЧ - хас да вирус түмүллүбүт бөлөҕө, бу вирустар аан дойдуга сүрдээх киэҥник тарҕаммыттар. Сүүстэн тахса ВПЧ вируһун көрүҥэ баара биллэр, олортон 14-дэ онкология ыарыытын төрдө-төрүөтэ буолаллар. Вирус сүрүннээн сылдьыһыы кэмигэр тарҕанар (половой путь), онон дьон үксэ сылдьыһар саастарыгар тиийэн баран сутуллаллар. Рак 70 бырыһыаныгар ВПЧ икки көрүҥэ булуллар (16-с уонна 18-с).',
                'Куттал үрдүүр фактордара:'
            ],
        },
        {
            type: 'column',
            elem: [
                'сылдьыһыы эрдэ саҕаланыыта;',
                'половой партнердары элбэхтэ уларытыы;',
                'презервативы туһаммакка сылдьыһыы;',
                'табахтааһын;',
                'иммунитеты баттыыр эмтэри иһии;',
                'оҕолонорго киэли хапчаҕайын травмалара;',
                'киэли хроническай ыарыылара: эрозия, лейкоплакия уо.д.а.;',
                'сылдьыһыы сыстыганнаах ыарыылара.',
            ],
        },
        {
            title: 'Симптомнара',
            type: 'text',
            elem: [
                'Киэли хапчаҕайын рагын саамай элбэхтик көстөр симптомнарынан элбэх уутуҥу убаҕас тахсыыта уонна сылдьыһыы кэнниттэн хааннаах убаҕас тахсыыта буолар.',
                'Төрүүр саастаах дьахталларга ыйдааҕыларын таһынан хаан кэлиитэ буолуон сөп, оттон менопауза буолбут буоллаҕына - ыарыы симптомунан кэмиттэн кэмигэр эбэтэр куруук кэлэр хаан буолуон сөп. ',
                'Искэн улааттаҕына ыалдьар буолар, иик тахсыыта хааччахтанар уонна хойуулуурга мэһэйдиир буолар.',
            ],
        },
    ]

    const data2 = [
        {
            align: 'start',
            text: [
                'ВОЗ скрининг үс көрүҥүн сүбэлиир:',
                '• ВПЧ баарын-суоҕун билэр тест;',
                '• Кольпоскопия;',
                '• ПАП-тест уонна убаҕас цитология ньымата (ЖЦ)'
            ],
        },
    ]

    const data3 = [
        {
            text: [
                'Киэли хапчаҕайын рагын (рак шейки матки) эрдэттэн билээри элбэх киһини чинчийии (скрининг) үс ньымалаах: киэли хапчаҕыйаттан ылыллыбыт цитология мазоктарын чинчийии (ПАП-тест), ВПЧ баарын-суоҕун билэр анаалыс уонна убаҕас цитология (ЖЦ). Искэн баара уорбалар түгэнигэр кольпоскопия оҥоһуллар, уонна бу чинчийии кэмигэр биопсия оҥоһуллар. Бу мэтиэдикэ киэли хапчаҕайын рагын эрдэ булар эрэ  буолбатах, ыарыы саҕаланарын тохтотор кыахтаах.',
                'Кэмиттэн кэмигэр көрдөрүнэр буоллахха киэли хапчаҕайын рагынан ыалдьыы 80% кыччыыр, оттон бу ыарыыттан өлүү 72% кыччыыр.',
            ],
        },
    ]

    return (
        <div>
            <InfoScreen
                title="КИЭЛИ ХАПЧАҔАЙЫН РАГА (РАК ШЕЙКИ МАТКИ)"
                description='КИЭЛИ ХАПЧАҔАЙЫН РАГА (РАК ШЕЙКИ МАТКИ) - киэли хапчаҕайын ис бүрүөһүнүн килиэккэлэриттэн үөскүүр ыарыы. Бу рак дьахтар ууһуур уорганнарын саамай элбэхтик көстөр рага буолар, дьахталлар онкологияннан ыалдьалларыгар бигэ 5-с миэстэни ылар.'
                img="Group66"
                infoImg="Frame6"
            />
            <TextInfoScreen data={data1} />
            <ThreeScreen data={data2} showInfoText={true} />
            <FourScreen data={data3} />
            <LinkToSurveysScreen link="" />
            <div style={{ display: 'flex', justifyContent: 'center' }}>
                <MyButton
                    sx={{
                        bgcolor: '#EB5757',
                        mb: 5
                    }}
                    onClick={() => {
                        setState(!state)
                    }}
                >
                    Посмотреть доступные анкеты
                </MyButton>
            </div>
            {state &&
                <MyContainer
                    wrapper={false}
                    minHeight={600}
                >
                    <CaruselSurvey />
                </MyContainer>
            }
        </div>
    )
}

export default Cervix