import React, { useState } from 'react'

import { InfoScreen, TextInfoScreen, ThreeScreen, FourScreen, LinkToSurveysScreen, MyContainer, MyButton } from '../../../components'

import { CaruselSurvey, TitleScreen } from '../../../constructor'

const Breath = () => {
    const [state, setState] = useState(false)
    const data1 = [
        {
            type: 'text',
            elem: [
                'Тыҥа рагын улаатыыта элбэх түгэннэртэн тутулуктаах. ВОЗ этэринэн рак сүрүн төрүөтүнэн тыҥа атын ыарыылара буоллаллар (куруук бэргиир хроническай бронхит, ХОБЛ, бронхоэктазтаах ыарыы уо.д.а.).',
                'Табахтааһын, саарбаҕа суох, рак ыарыы үөскүүрүгэр саамай тарҕаммыт фактор буолар. Рагы үөрэтэр аан дойдутааҕы агенство дааннайынан, рак 70-90 бырыһыана табаҕы кытта ситимнээх, табахтааһын рак үөскүүр кутталын 10 төгүл улаатынаннар.',
                'Өрөспүүбүлүкэҕэ 2019 сыллаахха 401 киһи тыҥа рагынан ыалдьыбыта биллибитэ. Ыарыы I-II стадиятыгар ыарыһахтартан 24,4 бырыһыаннарыгар диагноз турбут, III стадиятыгар - 35,8%, IV стадиятыгар - 39,4%. Диагноз турбутун кэннэ биир сыл иһинэн ыарыһах 55,9 бырыһыана өлбүт.'
            ],
        },
        {
            title: 'Симптомнара',
            type: 'text',
            elem: [
                'Үксүгэр тыҥа рага туох да сибикитэ суох саҕаланар, онон рак эрдэтээҥи стадияларара сылын ахсын ыытыллар медицинскэй чинчийиилэр кэмнэригэр эбэтэр атын ыарыыны эмтиир кэмҥэ биллэр.',
                'Ол да буоллар, ыарыы сороҕор симптомнаах саҕаланар, ол эрээри, симптомнара атын ыарыылар симптомнарыгар майгынныыр буолаллар.',
                'Сүрүн симптомнара:'
            ],
        },
        {
            title: '',
            type: 'column',
            elem: [
                'аҕылатар, салгыны эҕирийии ыараабыт курдук буолар;',
                'Хронический постоянный сухой кашель;',
                'арҕаҕырбыт силэ суох сөтөл;',
                'киһи саҥата кэһиэҕирэр;',
                'киһи куруук сэниэтэ суох буолар;'
            ],
        },
        {
            title: '',
            type: 'text',
            elem: [
                'Рак улахан стадияларыгар симптомнара атын ыарыттан уратылаах буолаллар:',
            ],
        },
        {
            title: '',
            type: 'column',
            elem: [
                'киһи саҥарбат буолан хаалар, эбэтэр саҥата уһун кэмҥэ кэһиэҕирэр;',
                'киһи сэниэтин эһэр сөтөл, силэ хойуу, тахсан биэрбэт (сороҕор хааннаах уонна ириҥэлээх буолар);',
                'түөс ыалдьар буолар;',
                'хомурҕан үрдүнээҕи былчархайдар көбөллөр уонна кытааталлар.',
            ],
        },
    ]

    const data2 = [
        {
            align: 'start',
            text: [
                'Тыҥа рагын эрдэ билэргэ түөс уорганнарын көннөрү флюорографияҕа түһэриллэр. Ону таһынан билигин намыһах дьайыылаах көмпүүтэр томограбынан (кылгатан нууччалыы НДКТ) чинчийиэххэ сөп. НДКТ — тыҥаҕа уонна түөс атын уорганнарыгар кыра да уларыйыы баар буоллаҕына чопчу көрдөрөр ньыма. НДКТ көмөтүнэн скрининг оҥоруу тыҥа рагыттан өлүүнү 44 бырыһыанынан кыччатара дакаастанан турар.',
            ],
        },
    ]
    const data3 = [
        {
            title: 'НДКТ ОҤОРОРГО ТӨРҮӨТТЭР:',
            type: 'text',
            text: [
                'Бу процедураны ханнык эрэ чопчу киһиэхэ оҥоруу кэтэһиллэр туһата киниэхэ оҥоһуллуон сөп омсотун куоһарыахтаах.',
                'Тыҥа ыарыытын симптомнара суох эбэтэр кыра симптомнаах 40 саастарыттан аҕа дьон, ону таһынан 20 сылтан ордук табахтаабыт дьон (күҥҥэ 1 пачканы 20 сыл устата тардыбыт эбэтэр күҥҥэ 2 пачканы 10 сыл иһигэр тардыбыт дьон).'
            ],
        },
        {
            title: 'НДКТ МАННЫК ТҮГЭННЭРГЭ ОҤОҺУЛЛУБАТ:',
            type: 'column',
            text: [
                '40 сааһын туола илик дьоҥҥо;',
                'Соторутааҕыта ыалдьа сылдьыбыт буоллаҕына (биир ый иһинэн пневмония, ОРВИ, КОВИД-19);',
                ' Атын рагынан ыалдьар эбэтэр ыалдьа сылдьыбыт буоллаҕына;',
                'КТ-ны биир сыл иһигэр ааһа сылдьыбыт буоллаҕына;',
                '37,5 кыраадыстан үрдүк температуралаах буоллаҕына;',
                'Наһаа кырдьаҕас (мөлтөөбүт) дьон.'
            ],
        },
    ]

    return (
        <div>
            <InfoScreen
                title="ТЫҤА РААГА"
                description='ТЫҤА РААГА - рак саамай тарҕаммыт уонна уодаһыннаах көрүҥнэриттэн биирдэстэрэ. 65 бырыһыана хойукку стадияларга (III, IV) ол аата атын уорганнарга тарҕаммытын, метастазтар баар буолбуттарын кэннэ биирдэ биллэр. Ону кытта бу ыарыыга өлүү таһыма үрдүк.'
                img="Group"
                infoImg="Frame7"
            />
            <TextInfoScreen data={data1} />
            <ThreeScreen data={data2} showInfoText={true} />
            <FourScreen data={data3} />
            <LinkToSurveysScreen link="" />
            <div style={{ display: 'flex', justifyContent: 'center' }}>
                <MyButton
                    sx={{
                        bgcolor: '#EB5757',
                        mb: 5
                    }}
                    onClick={() => {
                        setState(!state)
                    }}
                >
                    Анкеталары көрүү
                </MyButton>
            </div>
            {state &&
                <MyContainer
                    wrapper={false}
                    minHeight={600}
                >
                    <CaruselSurvey />
                </MyContainer>
            }
        </div>
    )
}

export default Breath