import React, { useState } from 'react'

import { InfoScreen, TextInfoScreen, ThreeScreen, FourScreen, LinkToSurveysScreen, MyContainer, MyButton } from '../../../components'

import { CaruselSurvey, TitleScreen } from '../../../constructor'

const Liver = () => {
    const [state, setState] = useState(false)
    const data1 = [
        {
            type: 'text',
            elem: [
                'Быарга рак үөскээһинин сүрүн фактора — быар хроническай ыарыыта буолар. Онтон сылтаан быарга бастаан фиброз үөскүүр, салгыы цирроз буолар. Үксүн ол төрүөтүнэн B, C, D вируснай гепатиттар уонна быарга сыа элбээн гепатоз үөскээбитэ буолаллар. Ону таһынан кутталы улаатыннарар фактордар: сааһырыы, табахтааһын, арыгылааһын, уойуу, килиэккэлэр инсулины “истибэт” буолуулара.',
                '2019 сыллаахха Саха Өрөспүүбүлүкэтигэр 176 быар рага диагнозтаммыта.',
                'Ыарыы I-II стадиятыгар ыарыһахтартан 25,5 бырыһыаннарыгар диагноз турбут, III стадиятыгар - 47,7%, IV стадиятыгар - 28,1%. Диагноз турбутун кэннэ биир сыл иһинэн ыарыһах 57,9 бырыһыана өлбүт.'
            ],
        },
        {
            title: 'Симптомнара',
            type: 'text',
            elem: [
                'Ыарыы түргэнник бэргиир, үксүн хойукку стадияларыгар көстөр. Быар рага быар атын ыарыыларыгар майгынныыр симптомнардаах буолар (холобур сибикилэрэ хроническай гепатит бэргииригэр, үөс тааһыгар иҥин майгынныыр). Быар рага саҕаланарыгар маннык симптомнардаах буолар:'
            ],
        },
        {
            title: '',
            type: 'column',
            elem: [
                'ис үллүүттэ, адаарыйыыта;',
                'саһарыы (үөс эргиирэ кэһиллиитин түмүгэр тирии, харах, айах иһэ, күөмэй саһархай дьүһүннэниитэ);',
                'иик хараҥа өҥнөнүүтэ, хойуу (саах) төттөрүтүн өҥө суох буолуута;',
                'куруук сылайбыт курдук сананыы, сэниэ суох буолуута;',
                'уҥа агда анныгар туох эрэ ыарахан баттыы сылдьыыта;',
                'тириигэ онон-манан көҕөрүүлэр көстөллөр, кыратык да бааһыртахха хаан тохтоон биэрбэтэ;',
                'аһыыр баҕа (аппетит) суоҕа эбэтэр кыратык да аһаатахха ис туолан хаалыыта;',
                'биллибэт төрүөтүнэн дьүдэйии.',
            ],
        },
        {
            title: '',
            type: 'text',
            elem: [
                'Быар рагын улахан стадиятыгар симптомнара атын ыарыылартан уратыланан киирэн бараллар.'
            ],
        },
    ]

    const data2 = [
        {
            align: 'start',
            text: [
                'аннык баҕарар онкология ыарыытын курдук быар рагар эмтээһин кыра стадияларга ордук хотуулаах буолар. Онон эрдэ диагноз туруоруу эмтээһинтэн кырата суох суолталаах.',
                'На сегодняшний день стандартной процедурой скрининга у групп высокого риска является: 1)ультразвуковое исследование (УЗИ) печени, 2)	определение онкомаркера (АФП). '
            ],
        },
    ]

    const data3 = [
        {
            title: 'СКРИНИНГ ОҤОРУУГА ТӨРҮӨТТЭР:',
            type: 'column',
            text: [
                'саҥа сүтэн хаалыыта, эбэтэр өр кэмҥэ саҥа кэһиэҕириитэ; ',
                'өр кэмҥэ тохтообот, сатаан тахсан биэрбэт хойуу силлээх сөтөл (сороҕор хааннаах уонна ириҥнэлээх);',
                'түөс ыалдьыыта;',
                'хомурҕан үрдүнэн кытаанах былчархай көбүүтэ.',
            ],
        },
    ]

    return (
        <div>
            <InfoScreen
                title="БЫАР РАГА (бастаан быартан саҕаламмыт рак)"
                description='БЫАР РАГА (бастаан быартан саҕаламмыт рак) — рак саамай элбэх уонна уодаһыннаах көрүҥнэриттэн биирдэстэрэ. Түргэнник улаатар, метастазтыыр уонна быар үлэтин харгыстыырын түмүгэр киһини түргэнник мөлтөтөр.'
                img="Group1"
                infoImg="Frame27"
            />
            <TextInfoScreen data={data1} />
            <ThreeScreen data={data2} showInfoText={true} />
            <FourScreen data={data3} />
            <LinkToSurveysScreen link="" />
            <div style={{ display: 'flex', justifyContent: 'center' }}>
                <MyButton
                    sx={{
                        bgcolor: '#EB5757',
                        mb: 5
                    }}
                    onClick={() => {
                        setState(!state)
                    }}
                >
                    Посмотреть доступные анкеты
                </MyButton>
            </div>
            {state &&
                <MyContainer
                    wrapper={false}
                    minHeight={600}
                >
                    <CaruselSurvey />
                </MyContainer>
            }
        </div>
    )
}

export default Liver