import React from 'react'
import Breast from './breastSurvey'

import { useLocation } from 'react-router-dom'

const BreastLanding = props => {
    const location = useLocation()

    let arr =
        [
            "Чугас аймахтарыҥ (ийэҥ/аҕаҥ, эбэҥ/эһэҥ, бииргэ төрөөбүттэриҥ) эмиий раагынан, оһоҕос раагынан, дьахтар уорганнарын раагынан ыалдьа сылдьыбыттара дуо?",
            "Эмиийгин тутан көрдөххүнэ туох эмит кытаанах баар курдук дуо?",
            "Түөһүҥ тириитигэр “лимон хаҕын курдук” учаастактаах дуо?",
            "Эмиийгиттэн убаҕас тахсар дуо?",
            "Эмиийиҥ чопчута уларыйбыт курдук буолла дуо (холобур, эмиийиҥ иһигэр киирбит курдук)?",
            "Бүтэһигин маммографияны хаһан ааспыккыный?",
            "Бигэргэтиллибит раак ыарыылааххын дуо?",
            "Ыйдааҕыҥ хас сааскар аан бастаан кэлбитэй?",
            "Төрөөбүтүҥ дуо?",
            "Бүтэһик 10 хонук иһигэр температуураҥ 37,5 кыраадыстан үрдүктүк тахса сылдьыбыттаах дуо?",
        ]
    return (
        <>
            <Breast arr={arr} id={location.state.surveyId} />
        </>
    )
}

export default BreastLanding