import React, { useState } from 'react'

import { InfoScreen, TextInfoScreen, ThreeScreen, FourScreen, LinkToSurveysScreen, MyContainer, MyButton } from '../../../components'

import { CaruselSurvey, TitleScreen } from '../../../constructor'

const Prostate = () => {
    const [state, setState] = useState(false)
    const data1 = [
        {
            type: 'text',
            elem: [
                'Ыарыы бастакы стадиятыгар искэн өр кэмҥэ туох да сибикитэ суох улаатыан сөп. Ол иһин 45 саастарын туолбут эр дьон кэмиттэн кэмигэр бырааска көрдөрүөхтээхтэр уонна анаалыс туттарыахтаахтар. Төһөннөн эрдэ ыарыы диагностанар да, оччонон эмтээһин туһалаах, үчүгэй түмүктээх буолар. Самах былчархайын раага 55 саастарыттан аҕа саастаах эр дьоҥҥо үксүн көстөр. Сылын ахсын аан дойдуга 6,5 тыһыынча киһи ыалдьара биллэр.',
                'Арассыыйаҕа самах былчархайын рага 7-8 миэстэни ылар.',
                'Саха Өрөспүүбүлүкэтигэр 2019 сыллаахха 114 киһи самах былчархайын раагынан ыалдьыбыта. Ыарыы I-II стадиятыгар ыарыһахтартан 54 бырыһыаннарыгар диагноз турбут, III стадиятыгар - 8,8%, IV стадиятыгар - 37,2%. Диагноз турбутун кэннэ биир сыл иһинэн ыарыһах 6,7 бырыһыана өлбүт.'
            ],
        },
        {
            title: 'Симптомнара',
            type: 'text',
            elem: [
                'Чопчу самах былчархайын рагын сибикитэ буолар симптом диэн суох. Маннык симптомнар баар буолуохтарын сөп:'
            ],
        },
        {
            type: 'column',
            elem: [
                'субу-субу ииктэтэр буолуута, ииктээбит кэннэ хабах  кураанахтамматах курдук буолуута, самахха туох эрэ хам тутар курдук буолуута эбэтэр ыалдьар  буолуута;',
                'Ыарыыны баалаппыт буоллахха - ииктииргэ хааччах үөскээһинэ, иик быста-быста кэлиитэ эбэтэр синньигэс баҕайытык кэлиитэ, иик кэлбэт буолуута, уһуннук ииктээһин, ииктииргэ ис былчыҥнарын көмөлөһүннэрии.'
            ],
        },
    ]

    const data2 = [
        {
            align: 'start',
            text: [
                'Самах былчархайын рагын диагностыырга маннык сүрүн ньымалары туһаналлар:',
                'Хаан анаалыһа - простат-специфическэй антиген (ПСА) хааҥҥа таһымын чинчийии. Скрининг 50 саастарын туолбут эр дьоҥҥо оҥоһуллар, ол эрээри сороҕор кутталлаах бөлөххө киирэр сорох дьонтон (холобур,  дьиэ кэргэннэригэр оннук ыарыы кимиэхэ эрэ диагностана сылдьыбыт түгэнигэр) эмиэ ылаллар:',
                'Самах былчархайын тарбаҕынан чинчийэн көрүү;',
                'Самах былчархайын УЗИ-лааһын.'
            ],
        },
    ]

    return (
        <div>
            <InfoScreen
                title="САМАХ БЫЛЧАРХАЙЫН РАГА"
                description='САМАХ БЫЛЧАРХАЙЫН РАГА - эр киһи ууһуур уорганнарыгар киирэр самах былчархайыгар үөскүүр.'
                img="prostata"
                infoImg="Frame27"
            />
            <TextInfoScreen data={data1} />
            <ThreeScreen data={data2} showInfoText={true} />
            <FourScreen />
            <LinkToSurveysScreen link="" />
            <div style={{ display: 'flex', justifyContent: 'center' }}>
                <MyButton
                    sx={{
                        bgcolor: '#EB5757',
                        mb: 5
                    }}
                    onClick={() => {
                        setState(!state)
                    }}
                >
                    Посмотреть доступные анкеты
                </MyButton>
            </div>
            {state &&
                <MyContainer
                    wrapper={false}
                    minHeight={600}
                >
                    <CaruselSurvey />
                </MyContainer>
            }
        </div>
    )
}

export default Prostate