import React, { useEffect, useState } from 'react'
import LiverSurvey from './liverSurvey'

import { useLocation } from 'react-router-dom'

const LiverWrapper = () => {
    const location = useLocation()

    let arr = [
        "Хроническай вируснай гепатит Б эбэтэр С диагноһын туруора сылдьыбыттара дуо?",
        " Анаалыстаан баран HBsAg (аш-би-эс антиген) хааҥҥар баар (положительнай) дииллэр этэ дуо?",
        "Быарыҥ циррозтаах дииллэр этэ дуо?",
        "Тирииҥ туох да биллэр төрүөтэ суох кыһыйар дуо, кыһыйара түүнүн күүһүрэр дуо?",
        "Уҥа агдаҥ аннынан аалан ыалдьааччы дуо?",
        "Хаан булкадаһыктааҕынан хотуолааччыгын дуо?",
        "Ыйааһыныҥ эмискэ түстэ дуо?",
        "Төрөппүттэриҥ быар раагынан ыалдьа сылдьыбыттара дуо?",
        "Бүтэһик 10 хонук иһигэр температуураҥ 37,5 кыраадыстан үрдүктүк тахса сылдьыбыттаах дуо?"
    ]
    return (
        <>
            <LiverSurvey arr={arr} id={location.state.surveyId} />
        </>
    )
}

export default LiverWrapper