const CardPerson = [
    {
        img: 'img/Element/Rectangle451.png',
        name: 'Айсен Сергеевич Николаев',
        tag: 'Глава Республики Саха',
        description: 'Для достижения целевых показателй реализации национальных проектов нам требуется перейти от штабных решений на современое и эффективное управление',
    },
    {
        img: '/img/Element/image76.png',
        name: 'Николаева Татьяна Ивановна',
        tag: 'Заместитель главного врача по лечебной работе государственного бюджетного учреждения Республики Саха (Якутия) «Якутский республиканский онкологический диспансер»',
        description: '«Уверена, что проект будет полезным для жителей Якутии и будет способствовать нашей победе в нелегкой борьбе с онкологическими заболеваниями»',
    },
    {
        img: '',
        name: '',
        tag: '',
        description: 'asdasd',
        infoImg: ''
    },
]

export default CardPerson