
const CardAbout = [
    {
        title: 'Скрининговый онлайн проект «ОНКОПОИСК» ориентирован на выявление предраковых состояний у практически здоровых людей или рака на ранних стадиях. ',
        body: 'Цель проекта – выявить заболевание как можно раньше, поставить без промедления диагноз, начать своевременное лечение. Скрининговый онлайн проект «ОНКОПОИСК» адаптирован к региональным особенностям Якутии и используется для формирования групп повышенного риска и эффективного отбора лиц, нуждающихся в первоочередном целенаправленном обследовании. Нами выбраны 6 основных видов рака, которые являются ведущими причинами смерти населения региона. Именно при этих опухолях имеется доказанная эффективность применения скрининговых технологий.',
        id: '1',
        color: '#61D8C5'
    },
    {
        title: 'При выявлении у анкетируемого высокой группы риска пациенту предлагается пройти высокоточное обследование ',
        body: '	При выявлении у анкетируемого высокой группы риска пациенту предлагается пройти высокоточное обследование в условиях Якутского республиканского онкологического диспансера в рамках ОМС с возможностью выбора даты и времени посещения клиники. В программу обследования входят основные лабораторные и инструментальные исследования, УЗИ-диагностика, низкодозная компьютерная томография органов грудной клетки и средостения в зависимости от группы риска. При этом от Вас необходимо только лишь согласие.',
        id: '2',
        color: '#61D8C5'
    },
    {
        title: 'Предоставляется возможность пройти более глубокое обследование в условиях поликлиники',
        body: 'По результатам анкетирования и дополнительного обследования предоставляется возможность пройти более глубокое обследование в условиях поликлиники онкодиспансера по «зеленому коридору».',
        id: '3',
        color: '#245852'
    },
    {
        title: 'Скрининг рака легкого - при наличии группы высокого риска',
        body: 'Вам предлагается пройти низкодозную компьютерною томографию (НДКТ) органов грудной клетки и средостения на современном 32-срезном компьютерном томографе BodyTom. Преимуществом НДКТ является высокая точность распознавания очаговых образований при низкой лучевой нагрузке, получаемой при обычном ФЛГ. Заодно Вам предлагается сдать кровь на онкомаркеры.',
        id: '4',
        color: '#245852'
    },
    {
        title: 'Скрининг рака молочной железы - при наличии группы высокого риска',
        body: 'Вам предлагается сдать кровь на онкомаркеры и пройти комплексное обследование молочной железы с применением ультразвукового исследования и маммографии.',
        id: '5',
        color: '#245852'
    },
    {
        title: 'Скрининг колоректального рака - при наличии группы высокого риска',
        body: 'Вам предлагается сдать кровь на онкомаркеры и пройти экспресс-тест на скрытую кровь в кале в домашних условиях. Тест в виде полоски, простой и понятный в использовании.',
        id: '6',
        color: '#245852'
    },
    {
        title: 'Скрининг рака печени - при наличии группы высокого риска',
        body: 'Вам предлагается сдать кровь на онкомаркеры и пройти прицельное УЗИ печени, лабораторное обследование крови – биохимические показатели, наличие или отсутствие носительства вирусного гепатита В и С.',
        id: '7',
        color: '#245852'
    },
    {
        title: 'Скрининг рака шейки матки - при наличии группы высокого риска',
        body: 'Вам предлагается сдать кровь на онкомаркеры и пройти осмотр врача онкогинеколога, лабораторное обследование мазков из шейки матки для ПАП-теста и жидкостной биопсии, определение носительства вируса папилломы человека (ВПЧ),',
        id: '8',
        color: '#245852'
    },
    {
        title: 'Скрининг рака предстательной железы - при наличии группы высокого риска',
        body: 'Вам предлагается сдать кровь на онкомаркеры и пройти УЗИ предстательной железы и расширенное исследование простат специфического антигена (ПСА).',
        id: '9',
        color: '#245852'
    },
]

export default CardAbout