
const CardAbout = [
    {
        title: 'Скрининг ыытар “ОНКОПОИСК” бырайыак чөл туруктаах дьону чинчийэн раак буолаары гыммыт туруктаах, эбэтэр раагынан саҥа ыалдьан эрэр дьону булууга туһуланар.',
        body: 'Бырайыак соруга - ыарыыны төһө кыалларынан эрдэ булуу, уталыппакка диагноз туруоруу, кэмигэр эмтээһини саҕалааһын. “Онкопоиск” бырайыак Саха сирин уратыларын учуоттаан ыалдьар кыахтаах дьону эрдэттэн түмэн сиһилии чинчийиигэ ыытыахтаах. Саха сиригэр саамай элбэх киһини өлөрөр рак 6 көрүҥүн таллыбыт. Бу искэннэргэ скринини (эрдэттэн элбэх киһини чинчийиини) туһанар улахан көдьүүстээҕэ дакаастанан турар.',
        id: '1',
        color: '#61D8C5'
    },
    {
        title: 'нкета толорооччу кутталлаах бөлөххө киирэрэ билиннэҕинэ, кинини Онкодиспансерга дириҥник чинчийиигэ барарыгар сүбэлиэхпит.',
        body: 'Бу чинчийии ОМС иһинэн ыытыллар (ол аата ыарыһахха босхо) уонна ыарыһах хаһан, хаска кэлэрин бэйэтэ талар. Чинчийии программатыгар киһи ханнык бөлөххө киирэриттэн тутулуктанан маннык чинчийиилэр киириэхтэрин сөп: лаборатория анаалыстара, анал тэрил көмөтүнэн чинчийии, УЗИ, намыһах дьайыылаах түөс томографията. Эйигиттэн сөбүлэҥ эрэ ирдэнэр.',
        id: '2',
        color: '#61D8C5'
    },
    {
        title: 'Анкеталааһын уонна эбии чинчийии кэнниттэн, ирдэнэр буоллаҕына, салгыы чинчийиини ааһарга кыах бэриллиэҕэ.',
        body: '',
        id: '3',
        color: '#245852'
    },
    {
        title: 'Тыҥа искэнингэр чинчийии - кутталлаах бөлөххө киирэр түгэҥҥэр намыһах дьайыылаах көмпүүтэр томографиятыгар (нууччалыы кылгатан НДКТ)',
        body: 'түөскэр баар уорганнаргын көрдөрүөххүн сөп. Чинчийии 32 түһэриини оҥорор саҥа BodyTom диэн аппараатынан оҥоһуллар. НДКТ үчүгэйэ диэн, ФЛГ курдук намыһах дьайыылаах эрээри кыра да уларыйыыны чопчу көрдөрөр. Таарыйа онкомаркерга хаан туттарыаххын сөп',
        id: '4',
        color: '#245852'
    },
    {
        title: ' Эмиий искэнигэр чинчийии - кутталлаах бөлөххө киирэр түгэҥҥэр хааҥҥын онкомаркердарга туттарыаххын, түөскүн УЗИ-латыаххын уонна маммография оҥотторуоххун сөп.',
        body: '',
        id: '5',
        color: '#245852'
    },
    {
        title: 'Суон оһоҕос искэнигэр чинчийии - кутталлаах бөлөххө киирэр түгэҥҥэр хааҥҥын онкомаркердарга туттарыаххын уонна хойуугар көстүбэт хаан баарын экспресс-тест көмөтүнэн билиэххин сөп. Тест кумааҕы лоскуйун курдук, туттарга судургу, чинчийиини бэйэҥ дьиэҕэр оҥостоҕун.',
        body: '',
        id: '6',
        color: '#245852'
    },
    {
        title: 'Киэли хапчаҕайын искэнигэр чинчийии - кутталлаах бөлөххө киирэр түгэҥҥэр хааҥҥын',
        body: 'онкомаркердарга туттарыаххын уонна онкогинеколог бырааска көрдөрүөххүн, хапчаҕайтан мазок биэрэн ПАП-тест диэн уонна убаҕас биопсия диэн анаалыстары туттарыаххын сөп, ону таһынан папиллома вируһун (ВПЧ) баарын-суоҕун билэр анаалыс туттарыаххын сөп.',
        id: '7',
        color: '#245852'
    },
    {
        title: 'Киэли хапчаҕайын искэнигэр чинчийии - кутталлаах бөлөххө киирэр түгэҥҥэр хааҥҥын',
        body: 'онкомаркердарга туттарыаххын уонна онкогинеколог бырааска көрдөрүөххүн, хапчаҕайтан мазок биэрэн ПАП-тест диэн уонна убаҕас биопсия диэн анаалыстары туттарыаххын сөп, ону таһынан папиллома вируһун (ВПЧ) баарын-суоҕун билэр анаалыс туттарыаххын сөп.',
        id: '8',
        color: '#245852'
    },
    {
        title: 'Самах былчархайын искэнигэр чинчийии - кутталлаах бөлөххө киирэр түгэҥҥэр хааҥҥын онкомаркердарга туттарыаххын уонна самах былчархайын УЗИ-латыаххын, простатспецифическэй антигеҥҥа анаалыс (ПСА) туттарыаххын сөп.',
        body: '',
        id: '9',
        color: '#245852'
    },
]

export default CardAbout