
const CardAbout = [
    {
        title: 'Скрининговый онлайн проект «ОНКОПОИСК» ориентирован на выявление предраковых состояний у практически здоровых людей или рака на ранних стадиях. ',
        body: 'Цель проекта – выявить заболевание как можно раньше, поставить без промедления диагноз, начать своевременное лечение. Скрининговый онлайн проект «ОНКОПОИСК» адаптирован к региональным особенностям Якутии и используется для формирования групп повышенного риска и эффективного отбора лиц, нуждающихся в первоочередном целенаправленном обследовании. Нами выбраны 6 основных видов рака, которые являются ведущими причинами смерти населения региона. Именно при этих опухолях имеется доказанная эффективность применения скрининговых технологий.',
        id: '1',
        color: '#61D8C5'
    },
    {
        title: 'Скрининговый онлайн проект «ОНКОПОИСК» ориентирован на выявление предраковых состояний у практически здоровых людей или рака на ранних стадиях. ',
        body: 'Цель проекта – выявить заболевание как можно раньше, поставить без промедления диагноз, начать своевременное лечение. Скрининговый онлайн проект «ОНКОПОИСК» адаптирован к региональным особенностям Якутии и используется для формирования групп повышенного риска и эффективного отбора лиц, нуждающихся в первоочередном целенаправленном обследовании. Нами выбраны 6 основных видов рака, которые являются ведущими причинами смерти населения региона. Именно при этих опухолях имеется доказанная эффективность применения скрининговых технологий.',
        id: '1',
        color: '#61D8C5'
    },
    {
        title: 'Скрининговый онлайн проект «ОНКОПОИСК» ориентирован на выявление предраковых состояний у практически здоровых людей или рака на ранних стадиях. ',
        body: 'Цель проекта – выявить заболевание как можно раньше, поставить без промедления диагноз, начать своевременное лечение. Скрининговый онлайн проект «ОНКОПОИСК» адаптирован к региональным особенностям Якутии и используется для формирования групп повышенного риска и эффективного отбора лиц, нуждающихся в первоочередном целенаправленном обследовании. Нами выбраны 6 основных видов рака, которые являются ведущими причинами смерти населения региона. Именно при этих опухолях имеется доказанная эффективность применения скрининговых технологий.',
        id: '1',
        color: '#245852'
    },
    {
        title: 'Скрининговый онлайн проект «ОНКОПОИСК» ориентирован на выявление предраковых состояний у практически здоровых людей или рака на ранних стадиях. ',
        body: 'Цель проекта – выявить заболевание как можно раньше, поставить без промедления диагноз, начать своевременное лечение. Скрининговый онлайн проект «ОНКОПОИСК» адаптирован к региональным особенностям Якутии и используется для формирования групп повышенного риска и эффективного отбора лиц, нуждающихся в первоочередном целенаправленном обследовании. Нами выбраны 6 основных видов рака, которые являются ведущими причинами смерти населения региона. Именно при этих опухолях имеется доказанная эффективность применения скрининговых технологий.',
        id: '1',
        color: '#245852'
    },
    {
        title: 'Скрининговый онлайн проект «ОНКОПОИСК» ориентирован на выявление предраковых состояний у практически здоровых людей или рака на ранних стадиях. ',
        body: 'Цель проекта – выявить заболевание как можно раньше, поставить без промедления диагноз, начать своевременное лечение. Скрининговый онлайн проект «ОНКОПОИСК» адаптирован к региональным особенностям Якутии и используется для формирования групп повышенного риска и эффективного отбора лиц, нуждающихся в первоочередном целенаправленном обследовании. Нами выбраны 6 основных видов рака, которые являются ведущими причинами смерти населения региона. Именно при этих опухолях имеется доказанная эффективность применения скрининговых технологий.',
        id: '1',
        color: '#245852'
    },
    {
        title: 'Скрининговый онлайн проект «ОНКОПОИСК» ориентирован на выявление предраковых состояний у практически здоровых людей или рака на ранних стадиях. ',
        body: 'Цель проекта – выявить заболевание как можно раньше, поставить без промедления диагноз, начать своевременное лечение. Скрининговый онлайн проект «ОНКОПОИСК» адаптирован к региональным особенностям Якутии и используется для формирования групп повышенного риска и эффективного отбора лиц, нуждающихся в первоочередном целенаправленном обследовании. Нами выбраны 6 основных видов рака, которые являются ведущими причинами смерти населения региона. Именно при этих опухолях имеется доказанная эффективность применения скрининговых технологий.',
        id: '1',
        color: '#245852'
    },
    {
        title: 'Скрининговый онлайн проект «ОНКОПОИСК» ориентирован на выявление предраковых состояний у практически здоровых людей или рака на ранних стадиях. ',
        body: 'Цель проекта – выявить заболевание как можно раньше, поставить без промедления диагноз, начать своевременное лечение. Скрининговый онлайн проект «ОНКОПОИСК» адаптирован к региональным особенностям Якутии и используется для формирования групп повышенного риска и эффективного отбора лиц, нуждающихся в первоочередном целенаправленном обследовании. Нами выбраны 6 основных видов рака, которые являются ведущими причинами смерти населения региона. Именно при этих опухолях имеется доказанная эффективность применения скрининговых технологий.',
        id: '1',
        color: '#245852'
    },
    {
        title: 'Скрининговый онлайн проект «ОНКОПОИСК» ориентирован на выявление предраковых состояний у практически здоровых людей или рака на ранних стадиях. ',
        body: 'Цель проекта – выявить заболевание как можно раньше, поставить без промедления диагноз, начать своевременное лечение. Скрининговый онлайн проект «ОНКОПОИСК» адаптирован к региональным особенностям Якутии и используется для формирования групп повышенного риска и эффективного отбора лиц, нуждающихся в первоочередном целенаправленном обследовании. Нами выбраны 6 основных видов рака, которые являются ведущими причинами смерти населения региона. Именно при этих опухолях имеется доказанная эффективность применения скрининговых технологий.',
        id: '1',
        color: '#245852'
    },
    {
        title: 'Скрининговый онлайн проект «ОНКОПОИСК» ориентирован на выявление предраковых состояний у практически здоровых людей или рака на ранних стадиях. ',
        body: 'Цель проекта – выявить заболевание как можно раньше, поставить без промедления диагноз, начать своевременное лечение. Скрининговый онлайн проект «ОНКОПОИСК» адаптирован к региональным особенностям Якутии и используется для формирования групп повышенного риска и эффективного отбора лиц, нуждающихся в первоочередном целенаправленном обследовании. Нами выбраны 6 основных видов рака, которые являются ведущими причинами смерти населения региона. Именно при этих опухолях имеется доказанная эффективность применения скрининговых технологий.',
        id: '1',
        color: '#245852'
    },
]

export default CardAbout