const CardPerson = [
    {
        img: 'img/Element/Rectangle451.png',
        name: 'Айсен Сергеевич Николаев',
        tag: 'Саха Өрөспүүбүлүкэтин Ил Дархана',
        description: '«Национальнай бырайыактары туһааннаах көрдөрүүгэ таһаарарга урукку халыыбынан буолбакка, кэмигэр сөпкө дьаһайан, көдьүүстээхтик салайыахтаахпыт»',
    },
    {
        img: '/img/Element/image76.png',
        name: 'Николаева Татьяна Ивановна',
        tag: '«Саха өрөспүүбүлүкэтин онкология диспансера» Судаарыстыбаннай бүддьүөт тэрилтэтин сүрүн бырааһа',
        description: '«Бырайыак онкология ыарыыларын кыайарбытыгар көмөлөһүө уонна Саха сирин олохтоохторугар туһалаах буолуо диэн эрэллээхпин»',
    },
    {
        img: '',
        name: '',
        tag: '',
        description: 'asdasd',
        infoImg: ''
    },
]

export default CardPerson