const Data = [
    {
        question: 'Рак скрининэ диэн тугуй? ',
        answer: 'Рак скрининэ диэн рагынан ыалдьыан иннинэ киһи организмыгар буолар уларыйыылары булуу, киһи бэйэтэ ыалдьыбытын билбэккэ сырыттаҕына рагы эрдэтээҥи стадиятыгар булуу.  Чинчийии рак ханнык эрэ уоргаҥҥа  үөскүүрэ үрдүк кутталлаах буоллаҕына ыытыллар. Маннык тестэр ыарыыны эрдэттэн, дириҥии илигинэ, эмтэнэр стадиятыгар буларга көмөлөһөллөр.'
    },
    {
        question: 'Рагы эрдэ диагностааһын диэн тугуй? ',
        answer: 'Рагы эрдэ диагностааһын диэн раак анал сибикитин таба көрөн ыарыыны эрдэ булуу. Төһө кыалларынан  эрдэ диагноз туруоран, уталыппакка эмтээһини саҕалыыр соруктаах.'
    },
    {
        question: '“Онкопоиск” хайдах үлэлиирий? ',
        answer: 'Бастакы түһүмэх: ханнык баҕарар киһи анкетаны толорор, кутталлаах бөлөххө киирэрэ билиннэҕинэ, киһи бэйэтин баҕатынан скрининг чинчийиини ааһарыгар сүбэ бэриллэр. Иккис түһүмэх: Кутталлаах бөлөххө киирбит пациент Онкодиспансерга хас да чинчийиини ааһар. Үһүс түһүмэх: Пациент тус бэйэтин “хоһугар” чинчийии түмүгүн ылар. Искэн баара уорбаланар түгэнигэр киһиэхэ эбии чинчийиини ааһарыгар направление бэриллиэҕэ.'
    },
    {
        question: 'Сорох анкеталар тоҕо үлэлээбэттэрий? ',
        answer: 'Былаан быһыытынан анкеталар түһүмэх-түһүмэх холбонуохтара.'
    },
    {
        question: 'Миигин кутталлаах бөлөххө киллэрдилэр, ол аата миэхэ рак баар дуо?',
        answer: 'Суох. Үрдүк кутталлаах бөлөххө киирии - ол аата Эйиэхэ раак үөскүүрүгэр төрүөт буолар хас да кутталлаах фактор баара биллибит эбит. Ол иһин дириҥ чинчийиини барыахтааххын.'
    },
    {
        question: 'В какой форме проходит консультация у психолога?',
        answer: 'Консультации могут проходить непосредственно в психологическом кабинете в Центре социально-психологической поддержки семьи и молодежи по адресу: г. Якутск, ул. Каландарашвили 21. Также консультации могут быть в онлайн формате через видеозвононк по мобильному телефону, Skype или Zoom.'
    },
    {
        question: 'Бырайыак пилотнай дэммит, тоҕо? ',
        answer: 'Саха сиригэр сабыс-саҥа бырайыак буолар, онон хайдах үлэлиирин сыаналыырга тургутууну ааһыахтаах. Элбэх дьону хабыахпыт иннинэ төһө эрэ киһини чинчийэр былааннаахпыт, ол түмүгүнэн хайдах салгыы тэрийэри, пациеннары хайдах түһүмэхтэн түһүмэххэ көһөрөрү нарылыахпыт, тупсарыахпыт. Кэлин бу бырайыакка Дьокуускай уонна улуустар поликлиникаларын холбуур былааннаахпыт.'
    }
]

export default Data