const Data = [
    {
        question: 'Когда необходима помощь психолога онкологическим пациентам?',
        answer: ''
    },
    {
        question: 'Нужна ли психологическая помощь близким и родственникам онкологических пациентов?',
        answer: ''
    },
    {
        question: 'В чем заключается помощь психолога и психотерапевта?',
        answer: ''
    },
    {
        question: 'Как записаться на консультацию к психологу?',
        answer: ''
    },
    {
        question: 'Бесплатна ли помощь психолога?',
        answer: ''
    },
    {
        question: 'В какой форме проходит консультация у психолога?',
        answer: ''
    },
    {
        question: 'Что такое периоды переживания тяжелого заболевания?',
        answer: ''
    }
]

export default Data