const Data = [
    {
        question: 'Когда необходима помощь психолога онкологическим пациентам?',
        answer: 'Если вы чувствуете негативные эмоциональные переживания, такие как страхи, беспокойство, тревогу или же вялось, упадок, потерю интереса ко всему, пожалуйста, обратитесь к психологу. Особенно, если эти состояния продолжаются несколько недель или вы чувствуете, что неспособны справиться с ними самостоятельно.'
    },
    {
        question: 'Нужна ли психологическая помощь близким и родственникам онкологических пациентов?',
        answer: 'Часто близкие и родственники пациентов также нуждаются в психологической помощи специалиста, поскольку они также находятся в состоянии дезадаптации – испытывают страх за близкого человека, чувства беспомощности, вины и т.д.'
    },
    {
        question: 'В чем заключается помощь психолога и психотерапевта?',
        answer: 'Информация о заболевании создает для пациента кризисную, экстремальную ситуацию. Он сталкивается с проблемой, которую не может решить сам. Цель работы психолога – коррекция эмоционального состояния. Психолог помогает человеку адаптироваться к новой реальности и найти в себе ресурсы для того, чтобы бороться. Психологическая помощь заключается также в том, чтобы дать людям возможность взглянуть на ситуацию с другой, более оптимистической стороны. '
    },
    {
        question: 'Как записаться на консультацию к психологу?',
        answer: 'Записаться на консультацию к психологу можно позвонив по телефону: 35-10-46 или 31-91-09. Если же Вы нуждаетесь в срочной психологической поддержке, можно позвонить на круглосуточный Республиканский психологический телефон доверия: 8-800-100-35-50 или Всероссийскую бесплатную круглосуточную горячую линию психологической помощи для онкологических больны и их близких: 8-800-100-01-91.'
    },
    {
        question: 'Бесплатна ли помощь психолога?',
        answer: 'Все консультации, а также обращение на телефон доверия и горячую линию – бесплатны.'
    },
    {
        question: 'В какой форме проходит консультация у психолога?',
        answer: 'Консультации могут проходить непосредственно в психологическом кабинете в Центре социально-психологической поддержки семьи и молодежи по адресу: г. Якутск, ул. Каландарашвили 21. Также консультации могут быть в онлайн формате через видеозвононк по мобильному телефону, Skype или Zoom.'
    },
    {
        question: 'Что такое периоды переживания тяжелого заболевания?',
        answer: 'Когда пациент узнает о диагнозе, независимо от того, онкология это или какое-то другое заболевание, он проходит несколько психологических периодов переживания. Все эти стадии необходимы для человека. Это нормальная реакция психики на кризис, на ненормальную ситуацию, на ситуацию болезни. Каждый человек проживает все стадии по-разному, он может «застревать» на одной из них или возвращаться снова к предыдущей стадии. Но считается, что наиболее благополучный вариант – пройти все до стадии принятия. Отрицание Гнев Торг Депрессия Принятие Отрицание или шок. Она очень типична: человек не верит, что у него есть потенциально смертельная болезнь. Больной начинает ходить от специалиста к специалисту, перепроверяя полученные данные, делает анализы в различных клиниках. В другом варианте он может испытывать шоковую реакцию и вообще больше не обращается в больницу. В этой ситуации нужно эмоционально поддержать человека, но не нужно менять эту установку, пока она не мешает лечению. Фаза протеста или дисфорическая фаза. Характеризуется выраженной эмоциональной реакцией, агрессией, обращенной на врачей, общество, родственников, гневом, непониманием причин болезни: «Почему это случилось именно со мной?» «Как это могло произойти?». В этом случае необходимо дать больному выговориться, высказать все свои обиды, негодование, страхи, переживания, представить ему позитивную картину будущего. Фаза торга или аутосуггестивная. Для этой стадии характерны попытки «выторговать» как можно больше времени жизни у самых разных инстанций, резкое сужение жизненного горизонта человека. В течение этой фазы человек может обращаться к богу, использовать разные способы продлить жизнь по принципу: «если я сделаю это, продлит ли мне это жизнь?». В этом случае важно предоставить человеку позитивную информацию. Так, хороший эффект в этот период дают рассказы о спонтанном выздоровлении. Надежда и вера в успех лечения являются спасательным кругом для человека. Фаза депрессии. На этой стадии человек понимает всю тяжесть своей ситуации. У него опускаются руки, он перестает бороться, избегает своих привычных друзей, оставляет свои обычные дела, закрывается дома и оплакивает свою судьбу. В этот период у родственников возникает чувство вины. В этой ситуации нужно дать человеку уверенность, что в этой ситуации он не один, что за его жизнь продолжается борьба, его поддерживают и за него переживают. Можно вести разговоры в сфере духовности, веры, а также психологически поддерживать и родственников пациента. Фаза принятия – это наиболее рациональная психологическая реакция. Больные мобилизуют свои усилия, чтобы продолжать жить с пользой для близких. Вышеперечисленные стадии не всегда идут в установленном порядке. Пациент может остановиться на какой-то стадии или даже вернуться на предыдущую. Однако знание этих стадий необходимо для правильного понимания того, что происходит в душе человека, столкнувшегося с тяжелой болезнью, и выработки оптимальной стратегии взаимодействия с ним.'
    }
]

export default Data